Revit 2027 API
BuiltInFailures.ImportFailures.TextNotImported Property
 Text is only imported if the "Current View Only" option is selected. To see the text in the original file, import again with this check box selected in the Import Dialog.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TextNotImported { get; }
Public Shared ReadOnly Property TextNotImported As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TextNotImported {
	FailureDefinitionId^ get ();
}
static member TextNotImported : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace